In [1]:
empty.dataframe <- data.frame()

empty.dataframe

In [2]:
print(empty.dataframe)

data frame with 0 columns and 0 rows

In [3]:
class(empty.dataframe)

[1] "data.frame"

In [4]:
students.dataframe <- data.frame("id" = NA, "name" = NA, "grade" = NA)

students.dataframe

  id name grade
1 NA NA   NA

In [5]:
str(students.dataframe)

'data.frame':	1 obs. of  3 variables:
 $ id   : logi NA
 $ name : logi NA
 $ grade: logi NA

In [6]:
ids <- 1000:1006
names <- c("Lucy", "Desmond", "Robert", "Joan", "Stacy", "Joe", "Doug")
grades <- c(3.4, 2.3, 3.7, 3.1, 2.9, 3.2, 3.5)

students.dataframe <- data.frame(ids, names, grades)

students.dataframe

  ids  names   grades
1 1000 Lucy    3.4
2 1001 Desmond 2.3
3 1002 Robert  3.7
4 1003 Joan    3.1
5 1004 Stacy   2.9
6 1005 Joe     3.2
7 1006 Doug    3.5

In [7]:
str(students.dataframe)

'data.frame':	7 obs. of  3 variables:
 $ ids   : int  1000 1001 1002 1003 1004 1005 1006
 $ names : Factor w/ 7 levels "Desmond","Doug",..: 5 1 6 3 7 4 2
 $ grades: num  3.4 2.3 3.7 3.1 2.9 3.2 3.5

In [8]:
students.dataframe <- data.frame(ids, names, grades, stringsAsFactors = FALSE)

students.dataframe

  ids  names   grades
1 1000 Lucy    3.4
2 1001 Desmond 2.3
3 1002 Robert  3.7
4 1003 Joan    3.1
5 1004 Stacy   2.9
6 1005 Joe     3.2
7 1006 Doug    3.5

In [9]:
str(students.dataframe)

'data.frame':	7 obs. of  3 variables:
 $ ids   : int  1000 1001 1002 1003 1004 1005 1006
 $ names : chr  "Lucy" "Desmond" "Robert" "Joan" ...
 $ grades: num  3.4 2.3 3.7 3.1 2.9 3.2 3.5

In [10]:
head(students.dataframe)

  ids  names   grades
1 1000 Lucy    3.4
2 1001 Desmond 2.3
3 1002 Robert  3.7
4 1003 Joan    3.1
5 1004 Stacy   2.9
6 1005 Joe     3.2

In [11]:
tail(students.dataframe)

  ids  names   grades
2 1001 Desmond 2.3
3 1002 Robert  3.7
4 1003 Joan    3.1
5 1004 Stacy   2.9
6 1005 Joe     3.2
7 1006 Doug    3.5

In [12]:
students.dataframe <- data.frame("student.id"=ids, 
                                 "student.name"=names, 
                                 "student.gpa"=grades, 
                                 stringsAsFactors = FALSE)

students.dataframe

  student.id student.name student.gpa
1 1000       Lucy         3.4
2 1001       Desmond      2.3
3 1002       Robert       3.7
4 1003       Joan         3.1
5 1004       Stacy        2.9
6 1005       Joe          3.2
7 1006       Doug         3.5

In [13]:
students.dataframe <- data.frame(ids, names, grades, stringsAsFactors = FALSE)

students.dataframe

  ids  names   grades
1 1000 Lucy    3.4
2 1001 Desmond 2.3
3 1002 Robert  3.7
4 1003 Joan    3.1
5 1004 Stacy   2.9
6 1005 Joe     3.2
7 1006 Doug    3.5

In [14]:
summary(students.dataframe)

      ids          names               grades
 Min.   :1000   Length:7           Min.   :2.300
 1st Qu.:1002   Class :character   1st Qu.:3.000
 Median :1003   Mode  :character   Median :3.200
 Mean   :1003                      Mean   :3.157
 3rd Qu.:1004                      3rd Qu.:3.450
 Max.   :1006                      Max.   :3.700

In [15]:
names(students.dataframe)

[1] "ids"    "names"  "grades"

In [16]:
rownames(students.dataframe)

[1] "1" "2" "3" "4" "5" "6" "7"

In [17]:
rownames(students.dataframe) <- LETTERS[1:7]

students.dataframe

  ids  names   grades
A 1000 Lucy    3.4
B 1001 Desmond 2.3
C 1002 Robert  3.7
D 1003 Joan    3.1
E 1004 Stacy   2.9
F 1005 Joe     3.2
G 1006 Doug    3.5

In [18]:
dimnames(students.dataframe)

[[1]]
[1] "A" "B" "C" "D" "E" "F" "G"

[[2]]
[1] "ids"    "names"  "grades"

In [19]:
length(students.dataframe)

[1] 3

In [20]:
nrow(students.dataframe)

[1] 7

In [21]:
ncol(students.dataframe)

[1] 3

In [22]:
students.dataframe[[1]]

[1] 1000 1001 1002 1003 1004 1005 1006

In [23]:
students.dataframe[[2]]

[1] "Lucy"    "Desmond" "Robert"  "Joan"    "Stacy"   "Joe"     "Doug"

In [24]:
students.dataframe$names

[1] "Lucy"    "Desmond" "Robert"  "Joan"    "Stacy"   "Joe"     "Doug"

In [25]:
students.dataframe$grades

[1] 3.4 2.3 3.7 3.1 2.9 3.2 3.5

In [26]:
students.dataframe[, 2]

[1] "Lucy"    "Desmond" "Robert"  "Joan"    "Stacy"   "Joe"     "Doug"

In [27]:
students.dataframe[3, ]

  ids  names  grades
C 1002 Robert 3.7

In [28]:
students.dataframe[3, 2]

[1] "Robert"

In [29]:
students.dataframe[, 2:3]

  names   grades
A Lucy    3.4
B Desmond 2.3
C Robert  3.7
D Joan    3.1
E Stacy   2.9
F Joe     3.2
G Doug    3.5

In [30]:
students.dataframe[2:5,]

  ids  names   grades
B 1001 Desmond 2.3
C 1002 Robert  3.7
D 1003 Joan    3.1
E 1004 Stacy   2.9

In [31]:
students.dataframe[c(2, 5),]

  ids  names   grades
B 1001 Desmond 2.3
E 1004 Stacy   2.9

In [32]:
students.dataframe[3:6, 2]

[1] "Robert" "Joan"   "Stacy"  "Joe"

In [33]:
students.dataframe[3:6, 2, drop=FALSE]

  names
C Robert
D Joan
E Stacy
F Joe

In [34]:
employee.data <- data.frame(id = 1001:1007,
                            
                            name = c("Amanda", "Isaac", "Philip", 
                                     "Felicia", "Jason", "George", "Lily"),
                            
                            department = c("Test Engineering", "Test Engineering", 
                                           "Engineering", "Engineering",
                                           "Sales", "HR", "Operations"),
                            
                            salary = c(135000, 28000, 40000, 166000, 135000, 40000, 50000),
                            
                            stringsAsFactors = FALSE)

In [35]:
employee.data

  id   name    department       salary
1 1001 Amanda  Test Engineering 135000
2 1002 Isaac   Test Engineering  28000
3 1003 Philip  Engineering       40000
4 1004 Felicia Engineering      166000
5 1005 Jason   Sales            135000
6 1006 George  HR                40000
7 1007 Lily    Operations        50000

In [36]:
engg.employee.data <- employee.data[employee.data$department == "Engineering", ]

engg.employee.data

  id   name    department  salary
3 1003 Philip  Engineering  40000
4 1004 Felicia Engineering 166000

In [37]:
engg.employee.data <- employee.data[grep("Engineering", employee.data$department), ]

engg.employee.data

  id   name    department       salary
1 1001 Amanda  Test Engineering 135000
2 1002 Isaac   Test Engineering  28000
3 1003 Philip  Engineering       40000
4 1004 Felicia Engineering      166000

In [38]:
employee.data[employee.data$salary >= 100000, ]

  id   name    department       salary
1 1001 Amanda  Test Engineering 135000
4 1004 Felicia Engineering      166000
5 1005 Jason   Sales            135000

In [39]:
employee.data[employee.data$salary < 50000 | employee.data$department == "Sales", ]

  id   name   department       salary
2 1002 Isaac  Test Engineering  28000
3 1003 Philip Engineering       40000
5 1005 Jason  Sales            135000
6 1006 George HR                40000

In [40]:
employee.mark <- list(1010, "Mark", "Sales", 67000)

employee.mark

[[1]]
[1] 1010

[[2]]
[1] "Mark"

[[3]]
[1] "Sales"

[[4]]
[1] 67000

In [41]:
employee.data <- rbind(employee.data, employee.mark)

employee.data

  id   name    department       salary
1 1001 Amanda  Test Engineering 135000
2 1002 Isaac   Test Engineering  28000
3 1003 Philip  Engineering       40000
4 1004 Felicia Engineering      166000
5 1005 Jason   Sales            135000
6 1006 George  HR                40000
7 1007 Lily    Operations        50000
8 1010 Mark    Sales             67000

In [42]:
employees.new <- data.frame(id = 1018:1020,
                            name = c("Donald", "Chelsea", "Patrick"),
                            department = c("HR", "HR", "Engineering"),
                            salary = c(70000, 86000, 25000))
employees.new

  id   name    department  salary
1 1018 Donald  HR          70000
2 1019 Chelsea HR          86000
3 1020 Patrick Engineering 25000

In [43]:
employee.data <- rbind(employee.data, employees.new)

employee.data

   id   name    department       salary
1  1001 Amanda  Test Engineering 135000
2  1002 Isaac   Test Engineering  28000
3  1003 Philip  Engineering       40000
4  1004 Felicia Engineering      166000
5  1005 Jason   Sales            135000
6  1006 George  HR                40000
7  1007 Lily    Operations        50000
8  1010 Mark    Sales             67000
9  1018 Donald  HR                70000
10 1019 Chelsea HR                86000
11 1020 Patrick Engineering       25000

In [44]:
employee.type <- sample(c("Contract", "Fulltime"), size=nrow(employee.data), replace=TRUE)

employee.type

 [1] "Fulltime" "Fulltime" "Fulltime" "Contract" "Contract" "Contract"
 [7] "Fulltime" "Fulltime" "Fulltime" "Fulltime" "Fulltime"

In [45]:
employee.data <- cbind(employee.data, type=employee.type)

employee.data

   id   name    department       salary type
1  1001 Amanda  Test Engineering 135000 Fulltime
2  1002 Isaac   Test Engineering  28000 Fulltime
3  1003 Philip  Engineering       40000 Fulltime
4  1004 Felicia Engineering      166000 Contract
5  1005 Jason   Sales            135000 Contract
6  1006 George  HR                40000 Contract
7  1007 Lily    Operations        50000 Fulltime
8  1010 Mark    Sales             67000 Fulltime
9  1018 Donald  HR                70000 Fulltime
10 1019 Chelsea HR                86000 Fulltime
11 1020 Patrick Engineering       25000 Fulltime

In [46]:
employee.data$gender <- c("F", "M", "M", "F", "M", "M", "F", "M", "M", "M", "M")

employee.data

   id   name    department       salary type     gender
1  1001 Amanda  Test Engineering 135000 Fulltime F
2  1002 Isaac   Test Engineering  28000 Fulltime M
3  1003 Philip  Engineering       40000 Fulltime M
4  1004 Felicia Engineering      166000 Contract F
5  1005 Jason   Sales            135000 Contract M
6  1006 George  HR                40000 Contract M
7  1007 Lily    Operations        50000 Fulltime F
8  1010 Mark    Sales             67000 Fulltime M
9  1018 Donald  HR                70000 Fulltime M
10 1019 Chelsea HR                86000 Fulltime M
11 1020 Patrick Engineering       25000 Fulltime M

In [47]:
employee.data <- cbind(employee.data, increment=employee.data$salary * 0.05)

employee.data

   id   name    department       salary type     gender increment
1  1001 Amanda  Test Engineering 135000 Fulltime F      6750
2  1002 Isaac   Test Engineering  28000 Fulltime M      1400
3  1003 Philip  Engineering       40000 Fulltime M      2000
4  1004 Felicia Engineering      166000 Contract F      8300
5  1005 Jason   Sales            135000 Contract M      6750
6  1006 George  HR                40000 Contract M      2000
7  1007 Lily    Operations        50000 Fulltime F      2500
8  1010 Mark    Sales             67000 Fulltime M      3350
9  1018 Donald  HR                70000 Fulltime M      3500
10 1019 Chelsea HR                86000 Fulltime M      4300
11 1020 Patrick Engineering       25000 Fulltime M      1250

In [48]:
employee.data$addl.increment <- ifelse(employee.data$salary < 50000, 
                                       employee.data$increment + 0.1 * employee.data$increment, 
                                       0)

employee.data

   id   name    department       salary type     gender increment
1  1001 Amanda  Test Engineering 135000 Fulltime F      6750
2  1002 Isaac   Test Engineering  28000 Fulltime M      1400
3  1003 Philip  Engineering       40000 Fulltime M      2000
4  1004 Felicia Engineering      166000 Contract F      8300
5  1005 Jason   Sales            135000 Contract M      6750
6  1006 George  HR                40000 Contract M      2000
7  1007 Lily    Operations        50000 Fulltime F      2500
8  1010 Mark    Sales             67000 Fulltime M      3350
9  1018 Donald  HR                70000 Fulltime M      3500
10 1019 Chelsea HR                86000 Fulltime M      4300
11 1020 Patrick Engineering       25000 Fulltime M      1250
   addl.increment
1     0
2  1540
3  2200
4     0
5     0
6  2200
7     0
8     0
9     0
10    0
11 1375

In [49]:
employee.data$new.salary <- employee.data$salary + employee.data$increment + employee.data$addl.increment

employee.data

   id   name    department       salary type     gender increment
1  1001 Amanda  Test Engineering 135000 Fulltime F      6750
2  1002 Isaac   Test Engineering  28000 Fulltime M      1400
3  1003 Philip  Engineering       40000 Fulltime M      2000
4  1004 Felicia Engineering      166000 Contract F      8300
5  1005 Jason   Sales            135000 Contract M      6750
6  1006 George  HR                40000 Contract M      2000
7  1007 Lily    Operations        50000 Fulltime F      2500
8  1010 Mark    Sales             67000 Fulltime M      3350
9  1018 Donald  HR                70000 Fulltime M      3500
10 1019 Chelsea HR                86000 Fulltime M      4300
11 1020 Patrick Engineering       25000 Fulltime M      1250
   addl.increment new.salary
1     0           141750
2  1540            30940
3  2200            44200
4     0           174300
5     0           141750
6  2200            44200
7     0            52500
8     0            70350
9     0            73500
10    0            90300
11 1375            27625

In [50]:
employee.professional.data <- data.frame(id = 1001:1005,
                            
                                         name = c("Amanda", "Isaac", "Felicia", "Jason", "Lily"),
                            
                                         department = c("Test Engineering", "Engineering", 
                                                        "Sales", "HR", "Operations"),
                            
                                         salary = c(135000, 28000, 40000, 40000, 50000),
                            
                                         stringsAsFactors = FALSE)

employee.professional.data

  id   name    department       salary
1 1001 Amanda  Test Engineering 135000
2 1002 Isaac   Engineering       28000
3 1003 Felicia Sales             40000
4 1004 Jason   HR                40000
5 1005 Lily    Operations        50000

In [51]:
employee.personal.data <- data.frame(id = 1002:1006,
                            
                                     name = c("Isaac", "Felicia", "Jason", "Lily", "Joanne"),
                            
                                     gender = c("M", "F", "M", "F", "F"),
                            
                                     stringsAsFactors = FALSE)

employee.personal.data

  id   name    gender
1 1002 Isaac   M
2 1003 Felicia F
3 1004 Jason   M
4 1005 Lily    F
5 1006 Joanne  F

In [52]:
merge(employee.professional.data, employee.personal.data)

  id   name    department  salary gender
1 1002 Isaac   Engineering 28000  M
2 1003 Felicia Sales       40000  F
3 1004 Jason   HR          40000  M
4 1005 Lily    Operations  50000  F

In [53]:
employee.personal.data <- data.frame(emp.id = 1002:1006,
                            
                                     first.name = c("Isaac", "Felicia", "Jason", "Lily", "Joanne"),
                            
                                     gender = c("M", "F", "M", "F", "F"),
                            
                                     stringsAsFactors = FALSE)

employee.personal.data

  emp.id first.name gender
1 1002   Isaac      M
2 1003   Felicia    F
3 1004   Jason      M
4 1005   Lily       F
5 1006   Joanne     F

In [54]:
merge(employee.professional.data, employee.personal.data)

   id   name    department       salary emp.id first.name gender
1  1001 Amanda  Test Engineering 135000 1002   Isaac      M
2  1002 Isaac   Engineering       28000 1002   Isaac      M
3  1003 Felicia Sales             40000 1002   Isaac      M
4  1004 Jason   HR                40000 1002   Isaac      M
5  1005 Lily    Operations        50000 1002   Isaac      M
6  1001 Amanda  Test Engineering 135000 1003   Felicia    F
7  1002 Isaac   Engineering       28000 1003   Felicia    F
8  1003 Felicia Sales             40000 1003   Felicia    F
9  1004 Jason   HR                40000 1003   Felicia    F
10 1005 Lily    Operations        50000 1003   Felicia    F
11 1001 Amanda  Test Engineering 135000 1004   Jason      M
12 1002 Isaac   Engineering       28000 1004   Jason      M
13 1003 Felicia Sales             40000 1004   Jason      M
14 1004 Jason   HR                40000 1004   Jason      M
15 1005 Lily    Operations        50000 1004   Jason      M
16 1001 Amanda  Test Engineering 135000 1005   Lily       F
17 1002 Isaac   Engineering       28000 1005   Lily       F
18 1003 Felicia Sales             40000 1005   Lily       F
19 1004 Jason   HR                40000 1005   Lily       F
20 1005 Lily    Operations        50000 1005   Lily       F
21 1001 Amanda  Test Engineering 135000 1006   Joanne     F
22 1002 Isaac   Engineering       28000 1006   Joanne     F
23 1003 Felicia Sales             40000 1006   Joanne     F
24 1004 Jason   HR                40000 1006   Joanne     F
25 1005 Lily    Operations        50000 1006   Joanne     F

In [55]:
merge(employee.professional.data, employee.personal.data, 
      by.x="id", by.y="emp.id")

  id   name    department  salary first.name gender
1 1002 Isaac   Engineering 28000  Isaac      M
2 1003 Felicia Sales       40000  Felicia    F
3 1004 Jason   HR          40000  Jason      M
4 1005 Lily    Operations  50000  Lily       F